---
kind: property
id: P:Autodesk.Revit.DB.TableCellCombinedParameterData.Prefix
source: html/89f301c6-4688-fd2b-e827-68339bac8dd5.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData.Prefix Property

The prefix for this parameter

## Syntax (C#)
```csharp
public string Prefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null